# Задача №37. 
# Дано натуральное число N и последовательность из N элементов.
# Требуется вывести эту последовательность в обратном порядке.
# Примечание. В программе запрещается объявлять массивы и использовать циклы 
# (даже для ввода и вывода).
# Input:    2 -> 3 4 Output: 4 3

s=['1','45','54','5','5','6','6','6','0']
print(' '.join(s)[::-1])